app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "123"], ["title", "123"], ["user_id", 6], ["created_at", "2018-07-06 22:32:06.842696"], ["updated_at", "2018-07-06 22:32:06.842696"]]

  def show
    if params[:search]
      @microposts = Micropost.search(params[:search]).order("created_at DESC")
---
SELECT "microposts".* FROM "microposts" WHERE (title LIKE '%first %') ORDER BY "microposts"."created_at" DESC, created_at DESC